{"data":{"markdownRemark":{"html":"<p><a href=\"https://www.escaladesports.com/\">Escalade Sports</a> is a sports equipment company with a portfolio of 40 brands across a wide variety of sports—from Goalrilla basketball hoops to Bear Archery bows to Onix pickleball paddles.</p>\n<p>Headquartered in Evansville, Indiana, USA, Escalade sells its equipment direct-to-consumers online, as well as through a network of local and regional distributors and specialty stores.</p>\n<p>Escalade recently started migrating its sites to Gatsby. They first chose to migrate one of their e-commerce brands, <a href=\"https://cajunbowfishing.com/\">cajunbowfishing.com</a> and recently relaunched it on Gatsby. Next they’ll be migrating the Escalade Sports homepage and then other brand sites.</p>\n<p><img src=\"./cajun-bowfishing-homepage.jpg\" alt=\"cajunbowfishing.com homepage\"></p>\n<h1 id=\"making-the-decision-to-migrate-to-gatsby\"><a href=\"#making-the-decision-to-migrate-to-gatsby\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Making the decision to migrate to Gatsby</h1>\n<p>When lead developer Kennedy Rose took responsibility for Escalade’s web stack, the first challenges he confronted were stability issues.</p>\n<p>“When I started, all of our sites were on Drupal,” said Rose. “The problem was that it wasn’t stable. The sites all shared a core, and when the core went down, everything went down.”</p>\n<p>Successful marketing efforts created traffic spikes — but the technology stack couldn’t keep up with demand.</p>\n<p>“Whenever we had a trade show, our sites would just go down,” Rose said, “We had to put a load balancer in front of multiple servers in order to keep it up. It just wasn’t working—and when that happens after a trade show, you’re just not getting your ROI.”</p>\n<p>As a long-time React fan, Rose turned first to a Node/Express stack to handle the stability issues, and then Next.js. Ultimately he moved away from the idea due to the complexity of handling the kinds of data he was dealing with.</p>\n<p>“We had to create custom modules during the build, then dump data into JSON, then import the JSON from these files, then pull it into the component using getInitialProps,” Rose explained. “There isn’t really a plugin ecosystem [in Next.js] - if you wanted to modify webpack in any way, you want to manually reach into configuration files.”</p>\n<p>Data loading is a big deal to Rose because of the way Escalade is structured. As a portfolio of brands, each brand is a department with wide latitude to run itself almost independently. That meant each brand has its own requirements and own APIs for its product catalog, that might or might not be formatted in similar ways.</p>\n<p><img src=\"./cajun-bowfishing-product-categories.jpg\" alt=\"cajunbowfishing.com product categories\"></p>\n<h1 id=\"benefits-theyve-found-using-gatsby\"><a href=\"#benefits-theyve-found-using-gatsby\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Benefits they’ve found using Gatsby</h1>\n<p>Then Rose found Gatsby. Gatsby’s plugin system solved his data problems—he was able to encapsulate data fetching into Gatsby plugins that ran at build time. It also prevented data bloat—he often didn’t need the full JSON data being returned by APIs, and with GraphQL he could query only what he needed.</p>\n<p>And as Escalade started to use Gatsby, Rose found other benefits.</p>\n<p>“Working with Gatsby, if someone does know React, there’s really not a whole lot more they need to learn,” says Rose. “We were able to get contractors on board much easier than with previous projects.”</p>\n<p>Working with another developer, a photographer, and a graphic designer, he found that projects progressed quicker because prototype code was suddenly reusable.</p>\n<p>“Almost all the code we used in prototyping went into production,” says Rose. “Especially back in the Drupal days, that was just not going to happen.</p>\n<p>Another unexpected benefit was the cost reduction of hosting static content, instead of running PHP servers. After migrating to Gatsby, Rose moved the cajunbowfishing.com website hosting over to <a href=\"www.netlify.com\">Netlify</a>.</p>\n<p>“Our bill went from $5,000 a month to $5,” he says.</p>\n<p>The most challenging piece of the move, Rose said, was helping others understand what the new technology stack looks like.</p>\n<p><img src=\"./cajun-bowfishing-products.jpg\" alt=\"cajunbowfishing.com products\"></p>\n<p>The Cajun Bowfishing store is a hybrid application, pulling in some data at build time using Gatsby plugins (Salsify, Markdown, custom pricing &#x26; stock APIs). Other data is queried live from the client—a shopping cart API and a dealer API for a map-based store locator.</p>\n<p>The trickiest part, Rose said, was communicating what the new stack looks like. “There’s a misconception about these technologies,” he says. “People would ask, ‘If we move away from Drupal does that mean that we don’t have a CMS anymore?’”</p>\n<p>What others took time to realize is that with a Gatsby site, all of the complexity Rose used to have to manage just went away.</p>\n<p>“Not having these systems,” Rose says, “is actually a benefit.”</p>","excerpt":"Escalade Sports  is a sports equipment company with a portfolio of 40 brands across a wide variety of sports—from Goalrilla basketball hoops…","timeToRead":3,"fields":{"slug":"/blog/2018-06-14-escalade-sports-from-5000-to-5-in-hosting/"},"frontmatter":{"title":"Escalade Sports: From $5000 to $5/month in Hosting With Gatsby","excerpt":null,"date":"June 21st 2018","rawDate":"2018-06-21","canonicalLink":null,"publishedAt":null,"tags":null,"image":null,"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Sam Bhagwat","bio":"Bay Area adoptee. Gatsby co-founder. Programmer, econ nerd, startup enthusiast","twitter":"@calcsam","avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M8 4L6 7c0 2 0 2 1 1 1-2 2-2 4-1 3 0 3 0 2 8l1 8v3l2 2c0 2 1 2 7 2h7v-3c0-3-1-3-4-3s-4 0-4-3c-1-1 0-3 1-4v-5l-1-3c0-6-9-9-14-5M5 27c-4 2-4 3 1 3 4 0 5-1 4-2l-1-2-4 1' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-eb2ad.jpg","srcSet":"/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-eb2ad.jpg 1x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-2d344.jpg 1.5x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-6dc12.jpg 2x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/sam-bhagwat/"}}}}},"pageContext":{"slug":"/blog/2018-06-14-escalade-sports-from-5000-to-5-in-hosting/","prev":{"fields":{"slug":"/blog/2018-06-08-life-after-layouts/","package":null,"starterShowcase":null},"frontmatter":{"title":"Life After Layouts","draft":null,"canonicalLink":null,"publishedAt":null,"tags":null}},"next":{"fields":{"slug":"/blog/2018-06-26-card-sort-results/","package":null,"starterShowcase":null},"frontmatter":{"title":"Presenting the Docs Redesign Card Sort Results","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["documentation"]}}}}