{"data":{"markdownRemark":{"html":"<blockquote>\n<p>“To improve is to change, so to be perfect is to have changed often.” — Winston Churchill</p>\n</blockquote>\n<p>And so it is that about every decade the technology industry rethinks the application architecture in light of new systems, capabilities, and desired outcomes. Right now we are in the early phases of another platform shift which will have massive ripple effects throughout the technology landscape. Current incumbents will fade in significance and new entrants will take their place within new categories. Hundreds of billions in market capitalization is at stake.</p>\n<p>This process of creative destruction tends to begin within the infrastructure sector but eventually has broad impact across the whole stack. Most of the attention in recent years has been focused around transforming the backend with the adoption of containers and microservices. Mobile has brought about changes to the presentation layer, but the timing is right for a more fundamental change in the presentation layer architecture — and the seeds of that change have begun.</p>\n<h2 id=\"where-have-we-come-from\"><a href=\"#where-have-we-come-from\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Where Have We Come From?</h2>\n<p>During the late-1980s the industry converged around the client-server model. While there were challengers, eventually Windows (it took until version 3.1!) emerged as the dominant end-user client environment. The applications in this era were relatively small, specific to a single operating system, and typically built for hundreds or thousands of users. In designing these applications, the choice was really whether you put the business logic directly into the client application or pushed it down into the database. Unix systems became the dominant server platforms largely based upon database performance requirements.</p>\n<p>The availability of the internet, and the birth of the browser — thank you, Marc Andreessen — greatly simplified cross-platform client development. However, these new applications now had to support several orders of magnitude more users. Consequently, several new tiers were added to the architecture: the web server and the application server. The web server and associated proxies and load balancers provided a stateless layer to handle the presentation layer. The application server became the obvious place for the business logic and to manage the interaction with the (typically relational) database server.</p>\n<p>As a result, developers struggled with the challenges of shifting from UI code to object-oriented programming models to the definition of underlying data schemas. In fact, much of the evolution in programming frameworks and libraries in the last decade or more has been aimed at solving this dissonance. Finally, these platforms were either extremely expensive to vertically scale or operationally challenging to horizontally scale.</p>\n<h2 id=\"where-are-we-now\"><a href=\"#where-are-we-now\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Where Are We Now?</h2>\n<p>The power within IT has clearly moved from infrastructure teams to application teams. Developers and architects prefer to think in services and they expect the infrastructure to be programmable, cheap, elastic, and secure. They no longer want to worry about low-level concerns of infrastructure management and instead, they want frictionless and limitless capabilities and then access to APIs for other services to help them compose applications. We are moving more toward an application- or service-centric model as opposed to an infrastructure-centric approach.</p>\n<p>Things are still evolving, but some of the elements of this new “cloud-native” architecture appear clear and include:</p>\n<ul>\n<li><strong>Cloud</strong>. Public or private cloud infrastructure provides the base services of compute, storage and networking. AWS, Azure, and Google are all racing to add more and more infrastructure and application services — though architects should actively consider finding abstractions that give them portability.</li>\n<li><strong>Containers</strong>: Containers provide the packaging format for how to build and deploy software as components. In earlier generations we were forced to think in larger constructs (.exe or jar files) that were sometimes tied to the underlying hardware, operating systems or runtimes.</li>\n<li><strong>Microservices</strong>: Microservices are components with well-defined API interfaces. This allows different parts of the system to evolve much more frequently and to scale independently. It also embraces the use of third-party operated services for common components like identity/auth, payments and more.</li>\n<li><strong>Application Management</strong>: Application servers have been replaced by cluster management solutions like Kubernetes. Virtualization was an intermediate step along the path to more elastic distributed systems. By leveraging the new cluster schedulers, systems can much more easily be built to be horizontally scalable and resilient.</li>\n<li><strong>Polyglot Data</strong>: Pick as many different data solutions as necessary depending on the different types of data and how it is accessed. Clearly, the SQL-based world of relational and analytics databases still matter, but very common data structures and access patterns now include: key/value caching, document/JSON, search, object, metrics/time-series and perhaps a few others. All of these new database solutions need to be natively distributed systems and simple to operate at any scale.</li>\n</ul>\n<p>These aspects all address the architecture for the backend application services and data. In this shift, open source software is prevalent and playing a critical role in every category of infrastructure software. Enterprise adoption of open source has skyrocketed as these open source solutions have been built specifically for cloud deployment and horizontal scalability.</p>\n<h2 id=\"whats-next\"><a href=\"#whats-next\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>What’s Next?</h2>\n<p>It is trite but true to say that every company is becoming a software company. This focus on digital transformation means that businesses are using apps and experiences as the primary interface to the customer. Most of the emphasis to date has been solving the backend services for digital transformation. But as an industry, we haven’t rethought the front-end presentation layer architecture which is a vital part of that new customer interface.</p>\n<p>We now live in a world of cheap compute and storage, cloud/edge capabilities, and generally fast and pervasive network coverage. So it seems the time has come to dramatically improve the presentation layer. In this world, for instance, running traditional web servers and web content management systems may not make sense anymore. It is incredibly inefficient to have a web server talking to a content management system to pull information, create a response page and send it back to the user. Serverless is gaining interest in terms of the back end architecture, so why not apply a similar approach to the presentation layer?</p>\n<p>For developers, there has always been rapid evolution in the area of presentation layer languages and frameworks. With the backing of Facebook (and fixing the open source licensing!), React may finally unify mobile and web client development. Developers have also been actively adopting API-driven headless CMS solutions. Another Facebook technology called GraphQL could provide a unified abstraction to backend data and services.</p>\n<p>Based on these new technologies, it seems that we can move to a new serverless presentation layer architecture with pre-built JavaScript code served from cloud/edge caches talking directly to backend or third-party microservices. Web and content management servers are no longer runtime components and instead, there is a process to build and deploy static or pre-compiled experiences. This new serverless architecture provides a number of dramatic improvements over the current approach, including:</p>\n<ul>\n<li><strong>Performance</strong>: Pages load much faster since they are served from caches, which are ideally geographically distributed.</li>\n<li><strong>Security</strong>: The attack surface is greatly reduced since you no longer have runtime web and CMS components that can be compromised.</li>\n<li><strong>Cost</strong>: The cost is completely variable and directly to usage, instead of having to size and pay for peak capacity.</li>\n<li><strong>Scalability</strong>: The presentation layer is completely elastic and requires no intervention to scale up and down.</li>\n<li><strong>Operations</strong>: There are no servers to manage.</li>\n<li><strong>Agility</strong>: The process of iterating on the user experience is greatly accelerated. Designers, developers and teams are able to leverage a familiar and tightly woven set of workflows and pipelines: from source code management through to the desired cloud platform.</li>\n</ul>\n<p>There are lots of pieces to this puzzle to still work out, but the shapes are starting to come into focus. The end result should be a streamlined process to design, build, test, and deploy new user experiences. And the resulting applications should be much faster, simpler to operate, cheaper to run, and more secure.</p>\n<blockquote>\n<p>“Some people don’t like change, but you need to embrace change if the alternative is disaster” — Elon Musk.</p>\n</blockquote>","excerpt":"“To improve is to change, so to be perfect is to have changed often.” — Winston Churchill And so it is that about every decade the…","timeToRead":5,"fields":{"slug":"/blog/2018-1-24-creative-software-destruction-new-presentation-layer/"},"frontmatter":{"title":"Creative Software Destruction and the New Presentation Layer","excerpt":null,"date":"January 24th 2018","rawDate":"2018-01-24","canonicalLink":null,"publishedAt":null,"tags":["architecture","serverless","cdn"],"image":null,"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Robin Vasan","bio":"Robin Vasan is an experienced early-stage venture investor and former repeat entrepreneur. His expertise covers the full life-cycle of building and scaling companies and he primarily invests in applications, cloud computing, open source, virtualization and security.","twitter":null,"avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M10 2C8 3 7 7 7 13c2 9 1 10-1 12l-4 3c-2 2-2 2 0 2s3-1 3-2l2-1h2c3 4 15 3 13-2-1-2-3-1-3 1-1 1-1 0-1-3l-1-5-1-4c0-2 0-3 1-2 0 2 2 2 3 0l-1-1c-2 0-5-4-4-5l2-1h1c1-1 1 0 2 2 2 3 2 3 2 1 0-4-7-8-12-6' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/robin-vasan-c73f1583abba7ebbcdc66257747f270f-eb2ad.jpg","srcSet":"/static/robin-vasan-c73f1583abba7ebbcdc66257747f270f-eb2ad.jpg 1x,\n/static/robin-vasan-c73f1583abba7ebbcdc66257747f270f-2d344.jpg 1.5x,\n/static/robin-vasan-c73f1583abba7ebbcdc66257747f270f-6dc12.jpg 2x,\n/static/robin-vasan-c73f1583abba7ebbcdc66257747f270f-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/robin-vasan/"}}}}},"pageContext":{"slug":"/blog/2018-1-24-creative-software-destruction-new-presentation-layer/","prev":{"fields":{"slug":"/blog/2018-01-22-getting-started-gatsby-and-wordpress/","package":null,"starterShowcase":null},"frontmatter":{"title":"Getting Started with Gatsby and WordPress","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["getting-started","wordpress"]}},"next":{"fields":{"slug":"/blog/2018-1-25-building-a-site-with-react-and-contentful/","package":null,"starterShowcase":null},"frontmatter":{"title":"Building a Site with React and Contentful","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["react","contentful","graphql"]}}}}