{"data":{"markdownRemark":{"html":"<p>Today we’re excited to announce our first commercial offering, a hosted Gatsby preview service for teams, with <a href=\"https://www.contentful.com/\">Contentful</a> as our initial integration. </p>\n<p>Since <a href=\"https://www.gatsbyjs.org/blog/2018-05-24-launching-new-gatsby-company/\">launching Gatsby Inc.</a>, we’ve loved hearing the increasing excitement from developers as more and more of you try out Gatsby and get hooked on the ability to easily create compelling, performant web experiences. </p>\n<p>With modern Javascript, React’s component model, and Progressive Web App features built in, Gatsby is a compelling alternative to traditional CMS site building, while still allowing content teams to use  mature CMS content workflows.</p>\n<p>But in our conversations with website teams at agencies and enterprises adopting Gatsby, we’ve heard a repeated concern. </p>\n<p>In a traditional CMS setup, content creators and editors are able to preview their changes out of the box before they go live. That workflow is difficult to recreate with Gatsby because it requires teams to set up their own preview infrastructure, which can be challenging. </p>\n<p>This is a problem because content teams <em>are</em> creators. And creators, as Bret Victor put it, “need an <em>immediate</em> connection to what they’re making.” </p>\n<p>When a copywriter edits a headline in their CMS, they shouldn’t have to <em>imagine</em> what their change looks like in context. They should see it—immediately. </p>\n<p>That’s why today, we’re excited to launch a hosted preview service for teams using Gatsby. </p>\n<p>With Gatsby Preview, once teams connect their Github repositories and CMS to our service, we’ll provide a live URL where content creators can see their changes <em>in context</em>. Curious how the new paragraph header would play with the graphic to the left or the footer below? Take  a look <em>before</em> you hit publish and your changes go live. </p>\n<p>While we continue development on this product, we’re releasing it today in an invite-only alpha. To <a href=\"https://www.gatsbyjs.com/preview/\">apply to use the service, fill out this form</a> and we’ll be in touch. There will be no charge for the service while it’s in alpha.</p>\n<p>Over the next few months, we’ll be adding integration with other CMSs like Drupal, Wordpress, and other hosted CMSs like Contentful, as well as moving Preview into general availability.</p>\n<p>We’re incredibly excited to launch our first commercial service and to continue to push forward the Gatsby experience! We’re looking forward to meeting more of you and working together to push forward the modern web.</p>\n<p>Before you go, take a look at a GIF of Gatsby Preview in action on our own <a href=\"gatsbyjs.com\">https://wwww.gatsbyjs.com</a> website:</p>\n<video controls=\"controls\" autoplay=\"true\" loop=\"true\">\n  <source type=\"video/mp4\" src=\"./gatsby-contentful-preview.mp4\"></source>\n  <p>Your browser does not support the video element.</p>\n</video>","excerpt":"Today we’re excited to announce our first commercial offering, a hosted Gatsby preview service for teams, with  Contentful  as our initial…","timeToRead":2,"fields":{"slug":"/blog/2018-07-17-announcing-gatsby-preview/"},"frontmatter":{"title":"Announcing Gatsby Preview","excerpt":null,"date":"July 17th 2018","rawDate":"2018-07-17","canonicalLink":null,"publishedAt":null,"tags":["contentful","preview","product"],"image":null,"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Sam Bhagwat","bio":"Bay Area adoptee. Gatsby co-founder. Programmer, econ nerd, startup enthusiast","twitter":"@calcsam","avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M8 4L6 7c0 2 0 2 1 1 1-2 2-2 4-1 3 0 3 0 2 8l1 8v3l2 2c0 2 1 2 7 2h7v-3c0-3-1-3-4-3s-4 0-4-3c-1-1 0-3 1-4v-5l-1-3c0-6-9-9-14-5M5 27c-4 2-4 3 1 3 4 0 5-1 4-2l-1-2-4 1' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-eb2ad.jpg","srcSet":"/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-eb2ad.jpg 1x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-2d344.jpg 1.5x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-6dc12.jpg 2x,\n/static/sam-bhagwat-b784beef37d89e601ff70300de125e5d-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/sam-bhagwat/"}}}}},"pageContext":{"slug":"/blog/2018-07-17-announcing-gatsby-preview/","prev":{"fields":{"slug":"/blog/2018-07-07-graphic-design-class/","package":null,"starterShowcase":null},"frontmatter":{"title":"Learning how to code with Gatsby","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["college","case study","design","getting-started"]}},"next":{"fields":{"slug":"/blog/2018-07-20-why-we-built-the-site-showcase/","package":null,"starterShowcase":null},"frontmatter":{"title":"Why We Created the Site Showcase","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["documentation","launch"]}}}}