{"data":{"markdownRemark":{"html":"<p>A few years ago, I worked at a small startup on an agile marketing team. This startup built website management tools and they had many customers come to them with stories of hosting headaches. I saw first-hand the hosting hassles that companies face.</p>\n<p>One of the biggest challenges was having your best day become your worst nightmare. An up-and-coming e-commerce site put a lot of effort into making a clean, interactive website in preparation for the holiday season. Their site looked amazing and they were ready to go! But they were using traditional hosting which means they were competing for server resources with other websites. Unfortunately, traffic spiked, the server couldn’t scale as quickly as needed, and their site went down. Their best day became their worst nightmare.</p>\n<p>In contrast, I’ve become a fan of Gatsby— a blazing-fast website development tool that eliminates the hosting hassles of managing complex, costly infrastructure. Gatsby is a new paradigm for building websites and there are some key benefits that are explained in this new one-page overview.</p>\n<h1 id=\"living-on-the-edge\"><a href=\"#living-on-the-edge\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Living on the edge</h1>\n<p>Gatsby sites scale quickly and easily because they live on the edge. There are no servers! With a Gatsby website, content is compiled ahead of time and stored directly on the CDN (content delivery network). Basically, this means that your website lives closest to your customers—wherever they are—which means it’s immediately available, instantly scalable, and loads with lightning-fast speed. And it’s inherently secure because hackers can’t access your database or CMS. Honestly, it’s like magic. I guess I’ve gotten used to pages that take a second or two to load (which is annoying but happens so often) but when I go to a Gatsby site, it’s almost instantaneous. It’s so much faster than anything I’ve seen before.</p>\n<p>Last week, I was on a long plane flight and decided to pay the $30 for in-flight wifi (yes, $30 for wifi. United- seriously?). It was a terrible connection and I couldn’t get any websites to load…except Gatsby. Gatsby loaded effortlessly and quickly while all other sites timed out. It was like a smooth magic carpet ride, flying from one page to the other. Amazing.</p>\n<p>So I’ve become a fan girl for Gatsby. It’s blazing-fast, secure, serverless, and lets me use the tools (CMS) that I already love. And this <a href=\"/gatsby-one-pager.pdf\">new one-page overview</a> is great in positioning Gatsby to the marketer, manager, agency, or team. The overview is perfect for:</p>\n<ul>\n<li>An agency or individual freelancer trying to help a client understand the benefits of this new technology</li>\n<li>An engineering manager trying to help less-technical stakeholders such as marketers or senior leadership understand why choosing Gatsby makes sense</li>\n<li>A developer who’s just launched a Gatsby website and coworkers are asking how you made it so fast and if you can do that for future projects</li>\n</ul>\n<p>Get a better understanding of what Gatsby can do for your website. <a href=\"/gatsby-one-pager.pdf\">Check it out</a>!</p>","excerpt":"A few years ago, I worked at a small startup on an agile marketing team. This startup built website management tools and they had many…","timeToRead":2,"fields":{"slug":"/blog/2018-06-08-gatsby-marketers-managers-agencies-teams/"},"frontmatter":{"title":"Gatsby for Marketers, Managers, Agencies and Teams","excerpt":null,"date":"June 8th 2018","rawDate":"2018-06-08","canonicalLink":null,"publishedAt":null,"tags":null,"image":null,"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Linda Watkins","bio":"Marketing execution machine. I think critically, adjust often, and find creative solutions to problems.","twitter":"@lindawatkins","avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M0 4c0 5 0 5 3 5s3 1 3 4a463 463 0 0 0-2 10c0-2 0-2-2 0s-2 7 0 7l1-2v-2l1 2c2 2 3 3 3 0h1l2 2 1-3V10c-1-2-1-2 1-2V7c-2-1 0-3 2-3 4 0 5 7 2 10l-1 2v7l-1 4c0 5 4 4 5-1l2-4 1-4c-2-9-2-12-1-11l1 2h7c1-1 2-2 2-5V0h-5A116 116 0 0 0 2 3C0 3 1 1 3 1c1-1 1-1-1-1S0 0 0 4m23 20c-2 6-2 6 2 6 3 0 4 0 3-1l-1-3-1-2h-3' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/linda-watkins-8f54d22c7e13b9abe95fa095d3d8988a-eb2ad.jpg","srcSet":"/static/linda-watkins-8f54d22c7e13b9abe95fa095d3d8988a-eb2ad.jpg 1x,\n/static/linda-watkins-8f54d22c7e13b9abe95fa095d3d8988a-2d344.jpg 1.5x,\n/static/linda-watkins-8f54d22c7e13b9abe95fa095d3d8988a-6dc12.jpg 2x,\n/static/linda-watkins-8f54d22c7e13b9abe95fa095d3d8988a-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/linda-watkins/"}}}}},"pageContext":{"slug":"/blog/2018-06-08-gatsby-marketers-managers-agencies-teams/","prev":{"fields":{"slug":"/blog/2018-06-07-build-a-gatsby-blog-using-the-cosmic-js-source-plugin/","package":null,"starterShowcase":null},"frontmatter":{"title":"Build a Gatsby Blog using the Cosmic JS source plugin","draft":null,"canonicalLink":"https://cosmicjs.com/articles/build-a-gatsby-blog-using-the-cosmic-js-source-plugin-jhzwvr45","publishedAt":"Cosmic JS","tags":null}},"next":{"fields":{"slug":"/blog/2018-06-16-announcing-gatsby-v2-beta-launch/","package":null,"starterShowcase":null},"frontmatter":{"title":"Announcing Gatsby v2 beta launch!","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["v2","gatsby"]}}}}