{"data":{"markdownRemark":{"html":"<p>We’re so happy you decided to try using Gatsby. This tutorial has an initial introduction plus seven more parts that’ll walk you from getting started developing and building Gatsby sites to deploying a finished and polished high performance static PWA.</p>\n<p>Note: If you prefer a quick start rather than step-by-step tutorial, see the <a href=\"/docs/\">getting started page</a>.</p>\n<p>This tutorial is for <em>everyone</em>! You do not need to be a programmer or React.js expert. We’ll walk you through things.</p>\n<ol start=\"0\">\n<li><a href=\"/tutorial/part-zero/\">Programming basics</a>: If you are new to programming, go here for an introduction to some basics like terminal, code editors, and browser consoles.</li>\n<li><a href=\"/tutorial/part-one/\">Introduction to Gatsby basics</a>: Starting new projects, developing, and deploying sites.</li>\n<li><a href=\"/tutorial/part-two/\">Introduction to using CSS in Gatsby</a>: Explore libraries like Typography.js and CSS Modules.</li>\n<li><a href=\"/tutorial/part-three/\">Building nested layouts in Gatsby</a>: Layouts are sections of your site that are reused across multiple pages like headers and footers.</li>\n</ol>\n<h2 id=\"advanced-tutorials\"><a href=\"#advanced-tutorials\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Advanced tutorials</h2>\n<p>In these advanced tutorials, you’ll learn how to pull data from almost anywhere into your Gatsby site with GraphQL.</p>\n<ol start=\"4\">\n<li><a href=\"/tutorial/part-four/\">Querying for data in a blog</a>: Create a blog and use a GraphQL query to pull your site title into the blog header.</li>\n<li><a href=\"/tutorial/part-five/\">Source plugins and rendering queried data</a>: Use a source plugin to pull Markdown blogposts into your site and create an index page with a list of blogposts.</li>\n<li><a href=\"/tutorial/part-six/\">Transformer plugins</a>: Use a transformer plugin to transform your Markdown blogposts into a form the blog can render.</li>\n<li><a href=\"/tutorial/part-seven/\">Programmatically create pages from data</a>: Learn how to programmatically create a set of pages for your blogposts.</li>\n</ol>","excerpt":"We’re so happy you decided to try using Gatsby. This tutorial has an initial introduction plus seven more parts that’ll walk you from…","timeToRead":1,"fields":{"slug":"/tutorial/","anchor":"tutorial"},"frontmatter":{"title":"Gatsby.js Tutorial"},"parent":{"__typename":"File","relativePath":"tutorial/index.md"}}},"pageContext":{"slug":"/tutorial/"}}