{"data":{"markdownRemark":{"html":"<h3 id=\"how-we-used-react-headless-wordpress-graphql--gatsby-to-build-mikes-new-online-platform\"><a href=\"#how-we-used-react-headless-wordpress-graphql--gatsby-to-build-mikes-new-online-platform\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How we used React, Headless WordPress, GraphQL &#x26; Gatsby to build Mike’s new online platform</h3>\n<p><a href=\"http://www.ecliptic.io\">Ecliptic</a> is a small development team out of Broomfield, Colorado. We build everything from high-performance content-driven sites to richly interactive web and mobile applications using React, GraphQL, and functional programming. <a href=\"https://www.mikejohnstonforcolorado.com\">Mike Johnston</a> is a Colorado gubernatorial candidate with an ambitious vision. When we heard about his ideas for an online platform to truly engage with his constituents and give them a real voice, we were excited about the opportunity to make his ideas into reality!</p>\n<p>While we’re still a few phases away from seeing Mike’s ultimate vision come to fruition, we’ve got the foundations in place and we’re putting the finishing touches on a gorgeous new interface for Mike’s homepage. Check it out at <a href=\"https://www.mikejohnstonforcolorado.com\">https://www.mikejohnstonforcolorado.com</a>!</p>\n<h2 id=\"laying-the-foundation-for-an-extensible-future\"><a href=\"#laying-the-foundation-for-an-extensible-future\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Laying the Foundation for an Extensible Future</h2>\n<p>Our goal was to provide a solid architecture to build a long-term future on top of. In later phases the site will become a full-fledged web application with an organizing and fundraising platform built-in, and the goal beyond that is to create an innovative “open source policy” platform to involve citizens in the policy-making process like never before!</p>\n<p>To execute on this effectively, we prioritized a few architectural goals:</p>\n<ul>\n<li><strong>System Resources</strong> — Sadly, public sector software budgets often don’t match those of their private sector counterparts. We wanted to pursue a system that would not require a large deployment, a lot of performance tuning, and constant monitoring and maintenance.</li>\n<li><strong>Security</strong> — It’s no secret that there are bad actors across the world that would love to influence campaigns and governance wherever they can. We wanted to provide strong protections to prevent hackers from gaining access and interfering.</li>\n<li><strong>Maintainability</strong> — If this stack is going to support a growing engagement and policy platform on a lean budget, it needs to be easy to work on. We wanted to maintain best practices wherever possible and use techniques that would be easy for someone to come in behind me and build on.</li>\n</ul>\n<h2 id=\"content-management-with-wordpress\"><a href=\"#content-management-with-wordpress\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Content Management with WordPress</h2>\n<p>The first decision we made was to use the ubiquitous <a href=\"http://wordpress.org\">WordPress</a> CMS to manage dynamic homepage content. WordPress has a lot of rough edges, but if you can work around them it provides an excellent admin with rich content editing. It’s also very widely used, so there’s a good chance that team members have had experience with it previously.</p>\n<p>The downside is that WordPress is implemented with <a href=\"http://www.php.net/\">PHP</a>, and it takes some effort to host and maintain it in an efficient way. As traffic grows, so does system load. When a site achieves great success, it also is introduced to a host of new performance problems caused by heavy traffic. Caching and query optimization can mitigate this greatly, but it takes a lot of time and effort to configure and maintain. In addition, it can be challenging to use modern front-end tools like React to their full potential.</p>\n<p>In addition, because WordPress is so broadly adopted it is often the subject of a lot of hacking effort. As exploits are discovered, they can be widely utilized because of the number of targets available.</p>\n<p>To work around these issues, we decided to go with a “headless” WordPress instance that only functions as an admin interface. Using tools like <a href=\"https://www.advancedcustomfields.com/\">Advanced Custom Fields</a> and the <a href=\"https://wordpress.org/plugins/custom-post-type-ui/\">Custom Post Type UI</a>, we created a very flexible repository for homepage content that is then available via the <a href=\"https://developer.wordpress.org/rest-api/\">REST API</a>. This frees us up to use whatever frontend tools are the best for the job, and adds a layer of separation from WordPress’s performance and security challenges.</p>\n<h2 id=\"static-site-generation-with-gatsby\"><a href=\"#static-site-generation-with-gatsby\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Static Site Generation with Gatsby</h2>\n<p>Since we had complete freedom on the front end, we wanted to pursue a solution based on <a href=\"https://reactjs.org/\">React</a>, our framework of choice in the browser. We’ve used <a href=\"https://reactjs.org/docs/react-dom-server.html\">Server Side Rendering</a> solutions in the past based on <a href=\"https://nodejs.org/en/\">Node</a> and <a href=\"https://expressjs.com/\">Express</a>, but over time they run into some of the same performance issues that PHP does. Server load is always a significant issue on dynamically rendered high-traffic applications, because they typically need to interact with a variety of other systems to construct each page. As concurrent requests grow, so does response time.</p>\n<p>One way to sidestep a great deal of these concerns is to make use of as much static content as possible. Static content is astonishingly light on system resources to serve up even at higher traffic levels, and it can be propagated to worldwide <a href=\"https://en.wikipedia.org/wiki/Content_delivery_network\">Content Delivery Networks</a> and served up to local users at lightning speeds. Static content traditionally has two big problems, however. It’s not trivial for non-technical users to update with frequently changing content, and it’s typically not very interactive or responsive.</p>\n<p><a href=\"https://www.gatsbyjs.org/\">Gatsby</a> is a project that has grown quickly into a best-of-both-worlds solution that is able to weave static file generation into a cohesive browser-based application complete with preloaded client-side routing to each static page. After the initial page load, Gatsby ensures that the browser begins fetching each additional page that is linked to ahead of time. When the user clicks a link, the browser doesn’t need to make an additional round-trip request to the server to get the next page. The experience of navigating around the site is noticeably faster than traditional page loads, and Gatsby provides a plugin to ensure that Google Analytics actions are still triggered for each routing event.</p>\n<h2 id=\"wordpress-integration-with-triggered-builds\"><a href=\"#wordpress-integration-with-triggered-builds\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>WordPress Integration with Triggered Builds</h2>\n<p>To connect with the content, we used Gatsby’s supported WordPress REST API plugin. This uses WordPress’s API discovery to identify all available endpoints, and then retrieves all content available from each one. It then makes the data available in its own <a href=\"http://graphql.org/\">GraphQL</a> schema, which it uses to power the build system API. This ends up being a novel and quite effective way to make it easy for front end developers to integrate with the data generated by the build system. Using a guided graphical query system, developers can discover the data available to them and test out different ways of querying and mutating it before they ever use it in their React components.</p>\n<p>Using the custom fields and post types, we built out a structure for managing content in a variety of different places on the site using the WordPress admin. Media is made available via the REST API, and Gatsby downloads each file used in the build locally so that it can apply image processing and responsive sizing. Using small custom scripts in the Gatsby project root, developers can turn WordPress content into GraphQL data that they can use anywhere on a page.</p>\n<p>The gotcha to all of this outstanding developer experience and astonishing client-side performance is that it is still not as easy as I’d like to update content. Each time content is updated on the headless WordPress instance, a custom PHP script triggers a build on our hosting platform. The build and deploy process currently takes about 5 minutes each time to run, so new content doesn’t show up right away. We have plans to optimize this in a variety of ways, but this is the current state.</p>\n<p>Our build process has been relatively fragile as we’ve worked around inconsistencies in the WordPress API and minor issues with the Gatsby plugin to interact with it. We expect this to stabilize over time as we identify issues and workarounds with real production use, however. The static site structure has been very helpful for resilience. The build may break and prevent new content from showing up, but it’s much less likely that an issue would actually bring the site down like it would in a dynamic application environment.</p>\n<h2 id=\"obscurity-isnt-security-but-it-helps\"><a href=\"#obscurity-isnt-security-but-it-helps\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Obscurity isn’t Security, but it Helps</h2>\n<p>The static site structure provides a layer of separation that makes potential attacks less damaging. If an attacker gains access to the machine containing the static content, they won’t discover anything that isn’t already publicly available. They can alter the content shown temporarily, but this can be solved in minutes with a new build and a new static server with fresh credentials. With some care, there should be little evidence leading back to the headless WordPress server managing content and administrator accounts.</p>\n<p>This is not an excuse for half-hearted security precautions or maintenance, however. It is still essential to keep your WordPress installation up to date and regularly audit server security. A skilled hacker often has a variety of different attack vectors they can use to gain pieces of information about your architecture — not all of them based on technology. Assume that your admin will be discovered, and take appropriate measures to keep data safe.</p>\n<p>Using tools like <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS\">CORS</a> headers, encrypted auth tokens, and secure connections you can still connect to remote APIs with strong protections for your users, systems, and data.</p>\n<h2 id=\"the-trail-ahead\"><a href=\"#the-trail-ahead\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The Trail Ahead</h2>\n<p>The WordPress solution is excellent for managing dynamic editorial content, but as we build out more interactive features we need to begin interacting with an API to show content that changes depending on the logged in user, or user-generated content. We could interact with the WordPress API directly, but that works against the aforementioned security and performance benefits of using a headless instance and a static build.</p>\n<p>Instead, we decided to go with an <a href=\"https://www.apollographql.com/\">Apollo</a> GraphQL server so that we could interact with the API server the same way we were interacting with the Gatsby content system. Using standard Express middleware and Apollo tools, we were able to quickly define a schema that both my server and client code can programmatically understand and help type-check during development. It’s working quite well to help us quickly build out interfaces with minimal data issues.</p>\n<p>Security and performance will obviously become greater concerns as the interactive application is built out, but we have more time to deal with that while the homepage is already up and running and serving up dynamic content with the performance of static files.</p>\n<h2 id=\"lets-chat\"><a href=\"#lets-chat\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Let’s Chat!</h2>\n<p>Have questions about the setup and future plans, or comments about our approach? We’re launching a branch new <a href=\"http://www.ecliptic.io\">homepage</a> this weekend with a new design and integrated chat that connects directly to our team’s Slack account. In the meantime, <a href=\"mailto:brandon@ecliptic.io\">send me an email</a> and let’s talk!</p>","excerpt":"How we used React, Headless WordPress, GraphQL & Gatsby to build Mike’s new online platform Ecliptic  is a small development team out of…","timeToRead":8,"fields":{"slug":"/blog/2018-3-03-case-study-mike-johnston/"},"frontmatter":{"title":"Case Study: Mike Johnston for Colorado","excerpt":null,"date":"March 3rd 2018","rawDate":"2018-03-03T00:00:00.000Z","canonicalLink":null,"publishedAt":null,"tags":["wordpress","netlify","security","case-studies"],"image":{"childImageSharp":{"resize":{"src":"/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-2c40b.png"},"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAANCAIAAAAmMtkJAAAACXBIWXMAAAsSAAALEgHS3X78AAACcklEQVQoz3VS+09ScRT//kP9FbW19UPLuXK11dpas2W2VmuLrUQWJuQDZj6QLFAgQVCmw4zykTzkghcE7r2Kr/mIC+h4XS4XuF6QjlqO5vrs88M53/M9j53PQTOBQJbjcjkmx7JsPg/Mc/lCocDmWUEQqtXq8V+Uy2VwF4IrD7o7X6pVj3oUKHp4UCiWIFb9P87zK5UKz/PQIMMw6UwGCfwfQGGInXU4q3V8ARCCcU7yWTaVTKJSqQRWmCKoyOrq+lqIIoBev2+FCJ7VqgW8QDKkcBxXLBQRzMAwjHV66uusfd7504m5d/Z2yTUyRIXhX6UG5VOcDFkqxhNxy6QFJVPpbDY3/d3+bW7WZp+hY/SRIMDU0Oe0CV8s8bAUWGMqk6Fj0Sgd292PzjncDY0P0aJ/yxPcNE3Zhk1jKp1OZza7ME80Hk/QvxKx/a2dzfXtDSpCktSKZ2nRajNarIaxCe2wfkCjVSNxb29zu+pZ1/CrvtGWjxODFvugaUqpNytGRtUmY5fmU49+yGDVmcZH+zX9I4Y+o16pVovHtTLMIEe37teJ2qTzvvDscsRHbhGbe+7QxgJOOgIETlLeEOGnyNAqgfkx0Qf5806JRCVX9r4Qt9TLxA3oztVLk0YNCMOy2QyTZljmXN1aqUG9JwN91yWtN9qk1xqu3Lt7ufnpTdQkk9uX3HyBS6eSLNxZLsvlWRC0IhzVXg7s+XFPd13r63rJm9sSqcL2YywYQe1e4gu1jccOvfSBjz4EguGNJrB/ubQfE5nHGz9rm7Qj7xzeDh/R5vIjmRNvd+JvHcs1BBeXXmCHJ9SJhYFyl1/uwt+7A78BIzp8/eyuQTQAAAAASUVORK5CYII=","aspectRatio":1.5972396486825595,"src":"/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-92508.png","srcSet":"/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-aa2b0.png 197w,\n/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-7948f.png 393w,\n/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-92508.png 786w,\n/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-a6b51.png 1179w,\n/static/mike-johnston-homepage-381c2528776adacc07460ee4ef13623b-d9441.png 1273w","sizes":"(max-width: 786px) 100vw, 786px"}}},"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Brandon Konkle","bio":"Full-stack developer building a flexible consulting team powered by React","twitter":"@bkonkle","avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M0 15v15h31V0H0v15m0 1c0 8 1 11 1 7a199 199 0 0 0-1-7m11-9c-2 4 1 12 4 12v1h-3c-3 0-2 2 0 3 5 3 11-12 6-16h-7' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/brandon-konkle-293a086dd4412fbc4899e5582b046113-eb2ad.jpg","srcSet":"/static/brandon-konkle-293a086dd4412fbc4899e5582b046113-eb2ad.jpg 1x,\n/static/brandon-konkle-293a086dd4412fbc4899e5582b046113-2d344.jpg 1.5x,\n/static/brandon-konkle-293a086dd4412fbc4899e5582b046113-6dc12.jpg 2x,\n/static/brandon-konkle-293a086dd4412fbc4899e5582b046113-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/brandon-konkle/"}}}}},"pageContext":{"slug":"/blog/2018-3-03-case-study-mike-johnston/","prev":{"fields":{"slug":"/blog/2018-02-28-documentation-project/","package":null,"starterShowcase":null},"frontmatter":{"title":"Introducing the Gatsby Documentation Project","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["ux","documentation","community"]}},"next":{"fields":{"slug":"/blog/2018-03-07-why-we-created-the-plugin-library/","package":null,"starterShowcase":null},"frontmatter":{"title":"Why we created the Gatsby plugin library","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["plugins","documentation"]}}}}