{"data":{"markdownRemark":{"html":"<p>A little while ago I had the six-monthly itch to redo my portfolio site, and I decided I was going to learn to use Gatsby. But that seems to be only half the battle. After you’ve built your front-end, how do you decide on the back-end? There’s so many out there!</p>\n<p><img src=\"gatsby.jpeg\" alt=\"GatsbyJS\"></p>\n<h2 id=\"background---why-gatsby\"><a href=\"#background---why-gatsby\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Background - Why Gatsby?</h2>\n<p>The only thing as abundant than Headless CMS options is Static Site Generator options. From Hugo (built on Google’s Go language) to Jekyll (Ruby) and even Nuxt which is based on VueJS. I picked Gatsby out of the pack for a number of reasons, chief amongst which is that I’m professionally a React.js developer, so getting to use React in these quick projects is a great benefit.</p>\n<p>Gatsby pitches as a “Blazing-fast static site generator for React”. So if I can build sites, but also encompass some React knowledge, all the better right? And I’m always looking for side-projects and sites for others, so if I can get a JAMstack sorted quicker and easier than my previous WordPress stack, then all the better going forward! I thought it was best to start with my own site, to test the viability.</p>\n<blockquote>\n<p><strong>What-stack?</strong> JAM stands for JavaScript, API, Markup. There are lots of benefits to this type of site, but the one I’m interested in is that your CMS is detached from your site - no hefty WordPress build for your tiny blog site.\n<a href=\"https://jamstack.org/\">You can read more on the JAMstack website</a>.</p>\n</blockquote>\n<p>I found Gatsby a real pleasure. You can find tutorials on their site for setup and once you see the code it’s fairly simple. I can personally recommend <a href=\"https://www.youtube.com/watch?v=b2H7fWhQcdE&#x26;list=PLLnpHn493BHHfoINKLELxDch3uJlSapxg\">Scott Tolinski’s series - available on Youtube</a>. Gatsby nicely wraps up React and React Router with a nice folder structure, webkit, ES6, SASS support and - importantly - GraphQL.</p>\n<blockquote>\n<p><strong>What-QL?</strong> GraphQL is a query language for APIs. Where in the WordPress Days I’d have to get the whole post just to display the title, with GraphQL I can tell the API to give me just the title.\n<a href=\"http://graphql.org/\">Their site is pretty handy too</a>.</p>\n</blockquote>\n<p>I got the site setup pretty quickly after learning about it. There’s a tonne of tutorials and instructional material around. And you can use as much or as little React as you want. There’s also a <a href=\"/docs/plugins/\">massive list of available plugins</a>, which is only going to grow.</p>\n<p>So if you have any experience with React, or if you’re just getting started, this is a great choice. Gatsby doesn’t tell you how your code has to look. In fact it’s setup so you can use Markdown files for pages, but I didn’t fancy that, so I don’t. Simple as that! Likewise, if I want to scale this to build websites for other people, I don’t want to spend ages teaching them how to use Markdown, clone a git repo and add it to the git repo. Queue a Headless CMS.</p>\n<p>You build your site. You’ve got your SASS, you’ve got your Markdown files (or not), but everything’s blank! So now what? How do we populate it with content?</p>\n<h2 id=\"the-next-step-a-back-end\"><a href=\"#the-next-step-a-back-end\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The Next Step: A back-end</h2>\n<p>Now we need a system to manage and deliver our content in a nice API (instructed by our GraphQL of course). And there’s a whole bunch of them about. To help us out, Gatsby has plugins that cater to some Headless CMS like the WordPress API, Contentful, Cockpit, Prismic and NetlifyCMS - which Gatsby actually has a guide for. I’ll be going through a few of these to see which one might be more useful for this small project, and going forward.</p>\n<blockquote>\n<p>After posting this, I heard some really good thing about <a href=\"https://graphcms.com/\">GraphCMS</a> - It’s designed to work with GraphQL inherently and they have a <a href=\"https://github.com/GraphCMS/graphcms-examples/tree/master/gatsby-source-plugin-blog\">Gatsby Starter Project</a> example to check out.</p>\n</blockquote>\n<p>Firstly, though, why do we want a Headless CMS and a JAMstack for the project? There are a few reasons most people use them, and some that are down to personal preference:</p>\n<ol>\n<li><strong>Easy setup!</strong></li>\n<li><strong>No back-end code.</strong> I’m a front-end dev and honestly don’t want to spend hours setting up some PHP that I won’t enjoy. Gimme the good stuff.</li>\n<li><strong>No server needed.</strong> Cloud CMSs mean that I don’t need to pay the hosting people to setup an SQL database.</li>\n<li><strong>Easy to edit.</strong> If I need to edit a site on the fly or have a client who needs to do the same, they don’t need to touch any code or run to their home workstation to fix a spelling error. They can access it anywhere.</li>\n</ol>\n<hr>\n<p><img src=\"contentful.png\" alt=\"Contenful\"></p>\n<h3 id=\"contentful\"><a href=\"#contentful\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Contentful</h3>\n<p>This is the one I’ve heard the most about in my research. Contentful is big and well-known - used by over 130 thousand developers if their website is to be believed. I also like their description “Fast. Flexible. Future-proof. It’s everything your CMS isn’t.” It might as well say “My CMS could beat up your CMS.”</p>\n<p>With all the acclaim, however, can come a hefty price tag. Contentful does have a free tier if you display their logo in the footer, you can keep up to 10,000 records and have 3 users - which isn’t bad at all. For my personal site I’m happy to plaster whatever attribution on the bottom. If you wanted to use this for a client and they were dead against someone else’s logo being on there, you can go up a half-tier with the same spec for $39 a month.</p>\n<p><img src=\"contentful-pricing.png\" alt=\"Contentful&#x27;s Pricing Packages\"></p>\n<p>From the paid Developer edition upwards, it seems a pretty steep fee, especially compared to some others. That said, if you’ve got a client willing to fork out a hot $949, why not?</p>\n<p><img src=\"contentful-project.png\" alt=\"A quick sample project\"></p>\n<p>As soon as you sign up (for free) you get access to a dashboard with some dummy content and links to tutorial videos*. You can see the dashboard with all of your content types. I setup a ‘Page’ type for the text on my pages. You could do posts or other custom types.</p>\n<blockquote>\n<p>* In the videos the guy pronounces Contentful like ‘content’ as in pleased or satisfied. I always thought it was Contentful with ‘content’ as in CMS. But what do I know? He works there.</p>\n</blockquote>\n<p><img src=\"contentful-page.png\" alt=\"Contentful&#x27;s well-laid-out post-types\"></p>\n<p>You then setup your fields, choosing from a big list. If you want a simple Title/Body you can set it up as above, or you can use times and dates, images, whole JSON Objects and more. You can also localise fields to only show in certain countries, make them required, and how they appear in the CMS. For example, I couldn’t see how to create a checkbox (as there isn’t a field-type for it), but if you create a Short text field you have the option to only allow certain values. Then, you can set the CMS-appearance to a drop-down or some radio buttons. I’d have liked that to be an option as soon as I add a field - something like WordPress’ custom fields - but once you know it’s there it makes sense.</p>\n<p><img src=\"contentful-fields.png\" alt=\"There are loads of field types available!\"></p>\n<p>Contentful looks like a fantastic service. It isn’t perfect but it checks all my boxes — and what do you want for nothing? It’s definitely the one to beat.</p>\n<hr>\n<p><img src=\"wp.jpeg\" alt=\"WP&#x27;s REST API\"></p>\n<h3 id=\"wordpress-rest-api\"><a href=\"#wordpress-rest-api\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>WordPress’ REST API</h3>\n<p>Ever since I started coding I’ve used WordPress as a traditional CMS. I’m familiar with how it works, the terminology and documentation. I know that WordPress is very very well-documented. The API includes ACF - a plugin known to most if not all WP devs and theme builders - which opens the posts out to accept all sorts of different fields. In fact, one of my issues about Contentful was based on my much-longer-term experience with ACF and WP.</p>\n<p>I’m sure I don’t need to spend too much time telling you the benefits of WordPress. The support is great, the interface is great, and it scales wonderfully. In fact WordPress boasts 29% of the entire internet uses their service. That’s absolutely huge. There are a million and one plugins for everything from SEO to E-commerce, Custom Post Types, Custom Fields and more.</p>\n<p>How does this hook up to our Gatsby build, then? Well if you have WordPress.com - WP’s free blogging platform - you can do it automatically for free. If you have WordPress.org - the big-brother that allows custom development - then you’ll need to host that somewhere (possibly free, but more likely paid-for if you get much traffic). My issue with the WP API is that I wanted something that would strip me of the usual server-database setup. But that’s what I’d need to run a WordPress.org CMS - even in a decoupled capacity. I really just one a one-stop-cloud-shop for my CMS like Contentful.</p>\n<p>The WordPress.com option is one to consider. They have a <a href=\"https://developer.wordpress.com/2016/11/11/wordpress-rest-api-on-wordpress-com/\">developer blog</a> about how to get started, which links to a really cool <a href=\"https://developer.wordpress.com/docs/api/console/\">API console</a> where you can experiment with the different types of requests you can make. In fact Gatsby makes this easier with the <a href=\"/packages/gatsby-source-wordpress\"><code class=\"language-text\">gatsby-source-wordpress</code> plugin</a>. In your Gatsby configuration file you set the URL of your WP install. Then in your WordPress site, <a href=\"http://developer.wordpress.com/apps/\">configure a new App</a>, and your data is ready to be pulled down using a GraphQL Query.</p>\n<p>A lot of this information came from a <a href=\"https://jeremey.blog/gatsby-photo/\">fantastic tutorial by Jeremey Duvall</a>. He goes through Gatsby, WordPress.com setup and hooking it up with GraphQL. It’s the whole setup right there.</p>\n<p>The only problem with the WordPress.com setup is that it’s restricted to posts and pages that boil down to title/image/content. If you want ACF or other plugins you’re going to need a paid-for WP package, which harks back to the WordPress.org issue: I can’t use it without paying for it.</p>\n<hr>\n<h3 id=\"netlifycms\"><a href=\"#netlifycms\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>NetlifyCMS</h3>\n<p>We’ll be hearing more about Netlify in another article - their original product is a CDN for your entire site, and I’ll be writing more about serving your Gatsby site - but right now we’ll focus on their CMS. Firstly, it’s build on React, so it’s a good bet it’ll play nice with Gatsby (not to mention the Gatsby plugin I mentioned earlier).</p>\n<p>One big difference from the others here is that the content in NetlifyCMS is kept in your Git repo, meaning that code and content are versioned together. You won’t ever lose content if you still have the repo, and you can see the history at the press of a button - same as you can with your code.</p>\n<p><a href=\"/docs/netlify-cms/\">Gatsby has a handy tutorial for NetlifyCMS</a> but they do stress that in order to save to Github etc, you will need your own server:</p>\n<blockquote>\n<p>To save your content in a Git repo, the repo will need to be hosted on a service like GitHub, and you’ll need a way to authenticate with that service so Netlify CMS can make changes through the service’s API. For most services, including GitHub, authentication will require a server.</p>\n</blockquote>\n<p>They also say, however, that if you use NetlifyCMS with Netlify, they conveniently handle the authenticating for you. Netlify will watch your Git repository for changes and update automatically. This is important to consider that they’re designed to be used together, so if you’re in for one it would benefit you to be in for the other. This isn’t law, but you can see why they’d make it more convenient if you lock into their ecosystem.</p>\n<p>Pedro Duarte has a <a href=\"https://medium.com/netlify/jamstack-with-gatsby-netlify-and-netlify-cms-a300735e2c5d\">great article</a> about using Gatsby with both Netlify and NetlifyCMS.</p>\n<hr>\n<h3 id=\"best-of-the-rest---prismicio--cockpit\"><a href=\"#best-of-the-rest---prismicio--cockpit\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Best of the rest - Prismic.io &#x26; Cockpit</h3>\n<p>Prismic is sort of a Contentful-like service that does basically the same thing with a few differences. I’m greeted to a post-type-creator similar to Contentful’s, I can create an editor with a number of fields similar such as Title, Body, Image, Location, Link, Color.</p>\n<p><img src=\"prismic.png\" alt=\"Prismic&#x27;s CMS\"></p>\n<p>Prismic has a similar pricing structure to Contentful - but has a few more options at the budget-end. In fact the only difference between the 3 smaller tiers is the number of users you can add to the CMS. Further than that there are some more premium versions with up to an infinite amount of users and some fancy features like user roles and collaboration. Certainly for bigger projects and bigger clients that would be useful.</p>\n<p><img src=\"prismic-pricing.png\" alt=\"They do have more pricing options than Contentful\"></p>\n<p>Cockpit also seems to share a lot of the same features except for two big differences:</p>\n<ul>\n<li>\n<p>It’s open source - anyone can download it, anyone can contribute to the git repository and improve it, meaning it’s fully free and will be available - in one form or another - forever. I could see an issue with Contentful if the service ever stopped working. They have backups on AWS and create nightly backups on their premium plans, but the actual interface may become unavailable. Because Cockpit is open source they could go out of business or go offline for a night or just stop working altogether, and there’s a repo available with your CMS on.</p>\n</li>\n<li>\n<p>It’s self-hosted - this ties into the last point and if it did all come crashing down, as long as your site is still active so will your CMS be. Great news for the tech-paranoid!</p>\n</li>\n</ul>\n<hr>\n<h2 id=\"conclusion---which-back-end-is-right\"><a href=\"#conclusion---which-back-end-is-right\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion - Which Back-End is right?</h2>\n<p>If nothing else, writing this article has given me a checklist that I need a CMS to fulfil. Some other CMSs have great features, but a couple of them are much more important to my use-case than others.</p>\n<h3 id=\"free-option\"><a href=\"#free-option\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Free Option</h3>\n<p>This is the top of the list. If I’m just messing about with the system, I don’t want to be forking out. If I have a larger project with a client who has actual money, then I’d reconsider. Also to this point I’d like it to be scalable. If I make a friend’s small site with Gatsby, and then overnight his company becomes million-pound business, I want to be able to upgrade the CMS to handle an increase in users or posts.</p>\n<h3 id=\"ease-of-use\"><a href=\"#ease-of-use\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Ease Of Use</h3>\n<p>Cloud-hosted or Git-hosted seem to be the best for this. I don’t need a server to run them and I can control it all in one place. The UI needs to be easy enough for a non-developer and it’d be nice if the system was well-supported so I could get help with issues when needed.</p>\n<p>In terms of which CMS to go with, they all have great merits and I can see them all being useful for different projects. But for my needs - for smaller side projects and for personal sites - Contentful and Prismic seem like the ones to go for. They’re both cloud-based with minimal setup and work via an API so I can access them wherever I need to. Also their free tiers have great features, and scale easily so that if I have a ‘proper’ project, I can get a version that will suit any needs.</p>\n<p>Was this post useful? Do you use any of these CMSs, or a different one? Please let me know, I’d love to hear about how you get one with them. And look out for a future post about hosting. I mentioned that NetlifyCMS runs great with Netlify, but there are other options! I’ll be looking at Github Pages, Heroku and more!</p>\n<p>You can find me on <a href=\"https://twitter.com/RossWhitehouse\">Twitter</a> and <a href=\"https://www.instagram.com/ross.dw/\">Instagram</a>, and <a href=\"https://medium.com/@RossWhitehouse\">check out my other posts</a>!</p>","excerpt":"A little while ago I had the six-monthly itch to redo my portfolio site, and I decided I was going to learn to use Gatsby. But that seems to…","timeToRead":11,"fields":{"slug":"/blog/2018-2-6-choosing-a-back-end/"},"frontmatter":{"title":"Picking a back-end for GatsbyJS","excerpt":null,"date":"February 6th 2018","rawDate":"2018-02-06","canonicalLink":null,"publishedAt":null,"tags":["headless-cms","wordpress","contentful","netlify-cms","jamstack"],"image":null,"imageAuthor":null,"imageAuthorLink":null,"imageTitle":null,"showImageInArticle":null,"author":{"id":"Ross Whitehouse","bio":"React and Front-End Developer from Birmingham, UK","twitter":"@RossWhitehouse","avatar":{"childImageSharp":{"fixed":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30' version='1'%3e%3crect width='100%25' height='100%25' fill='%23f6f2f8'/%3e%3cpath d='M0 2c0 2 0 2 1 1 1-3 8-3 9 1 3 4 2 6 0 8s-3 2-5 2H3c1 1 0 2-1 4l-2 7v5h31v-6l-1-5V7l1-7h-7c-6 0-6 0-6 2 1 1 0 3-1 4l-2 2V4l-1-4H7C0 0 0 0 0 2m18 6c-2 3-1 8 1 10s2 2 0 6v4h1l2-5 3-8 1-5c2-1 1-3-1-3h-2c0-2-5-1-5 1M7 17c1 2 2 2 4 1 3-2 2-3-3-3H5l2 2' fill='%23e0d6eb' fill-rule='evenodd'/%3e%3c/svg%3e","width":63,"height":63,"src":"/static/ross-whitehouse-f6d89f647a37ce1d0a0dbe6a71c6ee7a-eb2ad.jpg","srcSet":"/static/ross-whitehouse-f6d89f647a37ce1d0a0dbe6a71c6ee7a-eb2ad.jpg 1x,\n/static/ross-whitehouse-f6d89f647a37ce1d0a0dbe6a71c6ee7a-2d344.jpg 1.5x,\n/static/ross-whitehouse-f6d89f647a37ce1d0a0dbe6a71c6ee7a-6dc12.jpg 2x,\n/static/ross-whitehouse-f6d89f647a37ce1d0a0dbe6a71c6ee7a-c804e.jpg 3x"}}},"fields":{"slug":"/contributors/ross-whitehouse/"}}}}},"pageContext":{"slug":"/blog/2018-2-6-choosing-a-back-end/","prev":{"fields":{"slug":"/blog/2018-2-3-sites-with-headless-cms/","package":null,"starterShowcase":null},"frontmatter":{"title":"Building Sites with Headless CMSs","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["headless-cms","contentful","graphcms","cloudcms"]}},"next":{"fields":{"slug":"/blog/2018-2-7-jam-out-your-blog/","package":null,"starterShowcase":null},"frontmatter":{"title":"JAM Out Your Blog - Gatsby + Prose + Netlify","draft":null,"canonicalLink":null,"publishedAt":null,"tags":["prose-io","netlify","ci","jamstack"]}}}}